  var names = _.shuffle([
    Masculine names
    "تامر", "جميل", "سمير", "باسم", "لؤي", "موسى",
    "تيم", "أيمن", "قصي", "سيف", "حسام", "فارس", "حسن",
    "سامر", "وسيم", "جمال", "فادي", "عصام", "ليث", "باسل", "بلال",
    "خليل", "زاهر", "آدم", "أسامة", "أشرف", "أمجد", "أمير", "إياد",
    "يوسف", "طارق", "إسماعيل", "عيسى", "أنيس", "إيهاب", "كامل",
    "هادي", "جاد", "حاتم", "حبيب", "حسان", "أحمد", "هشام",
    "خالد", "سليمان", "حمزة", "راشد", "رشيد", "راغب", "عماد", "رامي",
    "غالب", "رائد", "ربيع", "رياض", "زياد", "زاهي", "سالم", "سليم", "طلال",
    "شادي", "عادل", "غسان", "فريد", "فؤاد", "فيصل", "كريم", "لطيف",
    "مازن", "ماجد", "مالك", "ماهر", 
    Feminine names:
    "مروة", "أميرة", "سماح", "منال",
    "رنا", "ريما", "نادين", "ندى", "لين ", "ليلى", "هدى",
    "سناء", "سهام", "هناء", "وفاء", "سارة", "سلمى", "سمر",
    "ميساء", "شادية", "صباح", "صفاء", "جومانة", "ياسمين", "غادة",
    "مها", "رحاب", "سحر", "مريم", "رجاء", "غدير", "رشا",
    "فاتن", "فادية", "سوسن", "أسماء", "نور", "هلا", "سهى", "نسرين",
    "جنى", "هبة", "ليال", "فرح", "عبير", "فريدة", "فيروز", "لبنى",
    "لمى", "غالية", "لميس", "نجوى", "أماني", "هيام", "أمل", "جنان",
    "جميلة", "وداد", "ديما", "أروى", "أسيل", "منى", "زهرة",
    "غيداء", "سمية", "سامية", "سامية", "فدوى", "زينة", "إيمان",
    "أمينة", "دلال"
  ]);
